// pages/index/detail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    text1: "春",
    text2: "暖",
    text3: "花",
    text4: "开",
    datam: [
      { "春暖花开": "春天气候温暖，百花盛开，景色优美。比喻游览、观赏的大好时机。 " },
      { "千军万马": "形容雄壮的队伍或浩大的声势。 " },
      { "张灯结彩": "张挂彩灯、彩带等，形容场面喜庆、热闹。 " },
      { "风和日丽": "形容天气晴朗暖和（多用于春天）。 " },
      { "万里长城": "长城的通称。 " },
      { "人来人往": "人来来往往连续不断。也形容忙于应酬。 " },
      { "自由自在": "形容没有约束，十分安闲随意。 " },
      { "瓜田李下": "古诗《君子行》：'瓜田不纳履，李下不正冠。'经过瓜田，不弯下身来提鞋，免得人家怀疑摘瓜；走过李树下面，不举起手来整理帽子，免得人家怀疑摘李子。后用'瓜田李下'比喻容易引起嫌疑的地方。 " },
      { "助人为乐": "帮助人就是快乐。 " },
      { "春风化雨": "适宜于草木生长的风雨，比喻良好的教育。 " },
      { "马到成功": "古时打仗，常以'旗开得胜，马到成功'祝愿迅速取得胜利。现在用来形容人一到那里，工作刚开始就取得成就。 " },
      { "拔苗助长": "古时候宋国有个人，嫌禾苗长得太慢，就一棵棵地往上拔起一点，回家还夸口说：'今天我帮助苗长了!'他儿子听说后，到地里一看，苗都死了（见于《孟子·公孙丑上》）。后用来比喻违反事物的发展规律，急于求成，反而坏事。也说拔苗助长。" },
      { "揠苗助长": "古时候宋国有个人，嫌禾苗长得太慢，就一棵棵地往上拔起一点，回家还夸口说：'今天我帮助苗长了!'他儿子听说后，到地里一看，苗都死了（见于《孟子·公孙丑上》）。后用来比喻违反事物的发展规律，急于求成，反而坏事。也说拔苗助长。" },
      { "安居乐业": "生活安定，对所从事的工作感到满意。《后汉书·仲长统传》：\'安居乐业，长养子孙，天下晏然。\' " },
      { "念念不忘": "牢记在心，时刻不忘：他所～的是祖国的命运和民族的前途。 " },
      { "落花流水": "形容暮春衰败的景色。宋赵长卿《鹧鸪天·送春》词：'落花流水一春休。' 后常用'落花流水'来比喻被打得大败：敌人被打得～。 " },
      { "一往无前": "指不把前进道路上的困难放在眼里，无所畏惧、毫不动摇地奋勇前进。 " },
      { "落地生根": "比喻长期安家落户或切切实实、一心一意地做好所从事的工作。 " },
      { "天罗地网": "上下四方都布下了罗网。比喻对敌人或逃犯设下的严密包围。罗：捕鸟的网。 " }
    ]
  },



  /**
   * 生命周期函数--监听页面加载
   */
  
  onLoad: function () {


  },


  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  },


  getLast: function(){

  },

  getNast: function () {

  }

})